performance/reports/archive/normal-day-2026-07-31T07-30-12/summary.txt
     ✓ login 200
     ✓ unread count 200
     ✓ post detail 200
     ✓ post reaction 2xx
     ✓ chat rooms 200
     ✓ ws handshake 101
     ✓ board list 200
     ✓ hot daily 200
     ✓ post list 200
     ✓ comment list 200
     ✓ notif list 200
     ✓ chat messages not 5xx
     ✓ post create 2xx
     ✓ chat read not 5xx
     ✓ post search 200
     ✓ read all 200
     ✓ logout 200
     ✓ friend list 200
     ✓ comment create 2xx
     ✓ post update not 5xx
     ✓ post delete not 5xx
     ✓ user info 200
     ✓ my posts 200
     ✓ meal today 200
     ✓ timetable today not 5xx
     ✓ meal month 200
     ✓ refresh 200
     ✓ scrap 2xx
     ✓ received reqs 200

     auth_token_refreshes...........: 3       0.006461/s
     chat_ws_errors.................: 12      0.025844/s
     chat_ws_messages_sent..........: 6       0.012922/s
   ✓ checks.........................: 100.00% ✓ 1163     ✗ 0   
     data_received..................: 9.7 MB  21 kB/s
     data_sent......................: 420 kB  904 B/s
     http_req_blocked...............: avg=28.5µs   min=0s      med=0s      max=11.82ms  p(90)=0s       p(95)=0s       p(99)=634.58µs
     http_req_connecting............: avg=10.88µs  min=0s      med=0s      max=1.29ms   p(90)=0s       p(95)=0s       p(99)=523.47µs
     http_req_duration..............: avg=36.54ms  min=3.25ms  med=12.49ms max=459.39ms p(90)=90.9ms   p(95)=108.97ms p(99)=218.22ms
       { expected_response:true }...: avg=36.54ms  min=3.25ms  med=12.49ms max=459.39ms p(90)=90.9ms   p(95)=108.97ms p(99)=218.22ms
     ✓ { feature:auth }.............: avg=85.31ms  min=14.78ms med=85.44ms max=171.52ms p(90)=97.2ms   p(95)=102.8ms  p(99)=136.93ms
     ✓ { feature:board }............: avg=5.01ms   min=3.54ms  med=4.66ms  max=11.68ms  p(90)=6.72ms   p(95)=7.58ms   p(99)=10.29ms 
     ✓ { feature:chat }.............: avg=10.59ms  min=3.38ms  med=8.84ms  max=108.58ms p(90)=12.84ms  p(95)=14.74ms  p(99)=47.01ms 
     ✓ { feature:comment }..........: avg=83.83ms  min=3.53ms  med=39.61ms max=459.39ms p(90)=209.56ms p(95)=225.12ms p(99)=347.46ms
     ✓ { feature:friend }...........: avg=6.97ms   min=4.94ms  med=6.33ms  max=14.04ms  p(90)=9.28ms   p(95)=11.66ms  p(99)=13.57ms 
     ✓ { feature:hot }..............: avg=17.72ms  min=10.55ms med=17.09ms max=47.38ms  p(90)=23.42ms  p(95)=25.35ms  p(99)=40.39ms 
     ✓ { feature:mypage }...........: avg=7.08ms   min=4.27ms  med=6ms     max=15.96ms  p(90)=13.39ms  p(95)=14.95ms  p(99)=15.76ms 
     ✓ { feature:notification }.....: avg=7.99ms   min=3.25ms  med=5.76ms  max=36.5ms   p(90)=13.82ms  p(95)=17.01ms  p(99)=26.78ms 
     ✓ { feature:post }.............: avg=11.37ms  min=3.31ms  med=9.47ms  max=110.53ms p(90)=17.24ms  p(95)=22.85ms  p(99)=35.29ms 
     ✓ { feature:reaction }.........: avg=31.95ms  min=17.56ms med=29.55ms max=53.08ms  p(90)=45.68ms  p(95)=47.65ms  p(99)=51.99ms 
     ✓ { feature:school }...........: avg=7.36ms   min=5.1ms   med=6.94ms  max=11.24ms  p(90)=10.07ms  p(95)=10.65ms  p(99)=11.12ms 
     ✓ { feature:scrap }............: avg=23.8ms   min=19.86ms med=22.12ms max=31.09ms  p(90)=28.43ms  p(95)=29.76ms  p(99)=30.82ms 
     ✓ { feature:timetable }........: avg=8.02ms   min=4.67ms  med=8.74ms  max=10.85ms  p(90)=10.02ms  p(95)=10.43ms  p(99)=10.77ms 
     ✓ { op:read }..................: avg=23.41ms  min=3.25ms  med=9.36ms  max=459.39ms p(90)=35.2ms   p(95)=176.03ms p(99)=224.01ms
     ✓ { op:write }.................: avg=71.33ms  min=4.82ms  med=81.93ms max=171.52ms p(90)=95.12ms  p(95)=100.74ms p(99)=134.6ms 
   ✓ http_req_failed................: 0.00%   ✓ 0        ✗ 1157
     http_req_receiving.............: avg=139.25µs min=0s      med=0s      max=7.3ms    p(90)=527.1µs  p(95)=757.36µs p(99)=1.9ms   
     http_req_sending...............: avg=22.29µs  min=0s      med=0s      max=1.01ms   p(90)=0s       p(95)=0s       p(99)=555.61µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=36.38ms  min=3.25ms  med=12.37ms max=458.23ms p(90)=90.9ms   p(95)=108.86ms p(99)=216.94ms
     http_reqs......................: 1157    2.491822/s
     iteration_duration.............: avg=8.42s    min=1.16s   med=6.18s   max=23.78s   p(90)=16.65s   p(95)=18.36s   p(99)=20.82s  
     iterations.....................: 232     0.499657/s
     vus............................: 1       min=0      max=8 
     vus_max........................: 8       min=8      max=8 
     ws_connecting..................: avg=7.4ms    min=4.8ms   med=6.06ms  max=14.63ms  p(90)=11.03ms  p(95)=12.83ms  p(99)=14.27ms 
     ws_msgs_received...............: 12      0.025844/s
     ws_msgs_sent...................: 18      0.038766/s
     ws_session_duration............: avg=4.4s     min=2.54s   med=4.8s    max=5.67s    p(90)=5.58s    p(95)=5.62s    p(99)=5.66s   
     ws_sessions....................: 6       0.012922/s